In [3]:
import pandas as pd
train=pd.read_csv('http://bit.ly/kaggletrain')

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#map allows to map an existing set of values to new values

In [6]:
train['sex_num']=train.Sex.map({'female':0,'male':1})

In [7]:
train.loc[0:4,['Sex','sex_num']]

      Sex  sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [8]:
###apply function

In [9]:
train['Name-Length']=train.Name.apply(len)

In [14]:
train.loc[0:4,['Name','Name-Length']]

                                                Name  Name-Length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [15]:
import numpy as np

In [17]:
train['fare_round']=train.Fare.apply(np.ceil)

In [20]:
train.loc[0:4,['Fare','fare_round']]

      Fare  fare_round
0   7.2500         8.0
1  71.2833        72.0
2   7.9250         8.0
3  53.1000        54.0
4   8.0500         9.0

In [22]:
train.Name.str.split(",").head() # each output is alist of lenth 2

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [ ]:
#### Get only the last names

In [24]:
def get_element(my_list,position):
    return my_list[position]

In [26]:
train.Name.str.split(",").apply(get_element,position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [27]:
train.Name.str.split(",").apply(lambda x:x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [28]:
## applty for dataframes

In [30]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [31]:
drinks.loc[:,'beer_servings':'wine_servings'].apply(max,axis=0) # max value in column

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [33]:
drinks.loc[:,'beer_servings':'wine_servings'].apply(max,axis=1).head() # max value in row

0      0
1    132
2     25
3    312
4    217
dtype: int64

In [34]:
drinks.loc[:,'beer_servings':'wine_servings'].apply(np.argmax,axis=0) # position of max value in column

beer_servings      117
spirit_servings     68
wine_servings       61
dtype: int64

## applymap- apply to every element in a dataframe

In [38]:
drinks.loc[:,'beer_servings':'wine_servings'].applymap(float).head()

   beer_servings  spirit_servings  wine_servings
0            0.0              0.0            0.0
1           89.0            132.0           54.0
2           25.0              0.0           14.0
3          245.0            138.0          312.0
4          217.0             57.0           45.0